
// { Plugin interface
&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "Файл с данными (*.mxl)|*.mxl"; 
	ДиалогФыбораФайла.Заголовок = "Выберите файл для загрузки данных";
	Если НЕ ДиалогФыбораФайла.Выбрать() Тогда
		Возврат; 
	КонецЕсли;	
	
	ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяФайла);
	
	Приемник = Объект.ЗагружаемыеДанные;
	Приемник.Очистить();
	Приемник.Область(1, 6).Текст = ТекущаяДата();
	Приемник.Вывести(ТабличныйДокумент);
	
	СохранитьНастройкиСервер();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СохранитьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВосстановитьНастройки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если НЕ Сервер Тогда
	Элементы.ФормаОчиститьБазу.Доступность = Ложь;
	#КонецЕсли
	
	ПрочитатьНастройкиСервер();
КонецПроцедуры


&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СоздатьДанныеПоТабличномуДокументу(Объект.ЗагружаемыеДанные);
	
	Сообщить("Загрузка завершена");
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ВыполнитьЗагрузкуНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОчиститьБазуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОчиститьБазу();
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьБазу(Команда)
	ОчиститьБазуНаСервере();
	
	Сообщить("Выполнена очистка информационной базы от данных");
КонецПроцедуры


&НаКлиенте
Процедура ЗагружаемыеДанныеПриИзменении(Элемент)
	СохранитьНастройкиСервер();
КонецПроцедуры

